MrBasset/esp8266_spa/src/main.cpp
  // ... and resubscribe
  mqtt.subscribe("Spa/command");
  mqtt.subscribe("Spa/target_temp/set");
  mqtt.subscribe("Spa/heatingmode/set");
  mqtt.subscribe("Spa/heat_mode/set");
  mqtt.subscribe("Spa/highrange/set");

  //OPTIONAL ELEMENTS
  if (SpaConfig.pump1 != 0) {
    mqtt.subscribe("Spa/jet_1/set");
  }
  if (SpaConfig.pump2 != 0) {
    mqtt.subscribe("Spa/jet_2/set");
  }
  if (SpaConfig.blower) {
    mqtt.subscribe("Spa/blower/set");
  }
  if (SpaConfig.light1) {
    mqtt.subscribe("Spa/light/set");
  }

  mqtt.subscribe("Spa/relay_1/set");
  mqtt.subscribe("Spa/relay_2/set");

  //not sure what this is
  last_state_crc = 0x00;

  //done with config
  have_config = PROCESSED_IT;
  have_preferences = PROCESSED_IT;
}

void reconnect() {
  //int oldstate = mqtt.state();
  //boolean connection = false;
  // Loop until we're reconnected
  if (!mqtt.connected()) {
    // Attempt to connect

    //make sure the MqttPassword pointer isn't null or empty
    if ((MqttPassword != NULL) && (MqttPassword[0] == '\0')) {
      //connection =
      mqtt.connect(String(String("Spa") + String(millis())).c_str());
    }
    else {
      //connection =
      mqtt.connect(String(String("Spa") + String(millis())).c_str(), MqttUser, MqttPassword);
    }
    //time to connect
    delay(1000);

    //have_config = 2;
    if (have_config == PROCESSED_IT && have_preferences == PROCESSED_IT) {
      //have_config = 2; // we have disconnected, let's republish our configuration
      mqttpubsub();
    }

  }
  mqtt.setBufferSize(512); //increase pubsubclient buffer size
}

// function called when a MQTT message arrived
void callback(char* p_topic, byte * p_payload, unsigned int p_length) {
  // concat the payload into a string
  String payload;
  for (uint8_t i = 0; i < p_length; i++) {
    payload.concat((char)p_payload[i]);
  }
  String topic = String(p_topic);

  mqtt.publish("Spa/node/debug", topic.c_str());
  _yield();

  // handle message topic
  if (topic.startsWith("Spa/relay_")) {
    bool newstate = 0;

    if (payload.equals("ON")) newstate = LOW;
    else if (payload.equals("OFF")) newstate = HIGH;

    if (topic.charAt(10) == '1') {
      pinMode(RLY1, INPUT);
      delay(25);
      pinMode(RLY1, OUTPUT);
      digitalWrite(RLY1, newstate);
    }
    else if (topic.charAt(10) == '2') {
      pinMode(RLY2, INPUT);
      delay(25);
      pinMode(RLY2, OUTPUT);
      digitalWrite(RLY2, newstate);
    }
  } else if (topic.equals("Spa/command")) {
    if (payload.equals("reset")) hardreset();
  } else if (topic.equals("Spa/heatingmode/set")) {
    if (payload.equals("ON") && SpaState.restmode == 1) send = 0x51; // ON = Ready; OFF = Rest
    else if (payload.equals("OFF") && SpaState.restmode == 0) send = 0x51;
  } else if (topic.equals("Spa/heat_mode/set")) {
    if (payload.equals("heat") && SpaState.restmode == 1) send = 0x51; // ON = Ready; OFF = Rest
    else if (payload.equals("off") && SpaState.restmode == 0) send = 0x51;
  } else if (topic.equals("Spa/light/set")) {
    if (payload.equals("ON") && SpaState.light == 0) send = 0x11;
    else if (payload.equals("OFF") && SpaState.light == 1) send = 0x11;
  } else if (topic.equals("Spa/jet_1/set")) {
    if (payload.equals("ON") && SpaState.jet1 == 0) send = 0x04;
    else if (payload.equals("OFF") && SpaState.jet1 == 1) send = 0x04;
  } else if (topic.equals("Spa/jet_2/set")) {
    if (payload.equals("ON") && SpaState.jet2 == 0) send = 0x05;
    else if (payload.equals("OFF") && SpaState.jet2 == 1) send = 0x05;
  } else if (topic.equals("Spa/blower/set")) {
    if (payload.equals("ON") && SpaState.blower == 0) send = 0x0C;
    else if (payload.equals("OFF") && SpaState.blower == 1) send = 0x0C;
  } else if (topic.equals("Spa/highrange/set")) {
    if (payload.equals("ON") && SpaState.highrange == 0) send = 0x50; //ON = High, OFF = Low
    else if (payload.equals("OFF") && SpaState.highrange == 1) send = 0x50;
  } else if (topic.equals("Spa/target_temp/set")) {
    // Get new set temperature
    double d = payload.toDouble();
    if (d > 0) d *= 2; // Convert to internal representation
    settemp = d;
    send = 0xff;
  }
}

/// UPDATE FILESYSTE
void update_started() {
  mqtt.publish("Spa/node/debug", "Updated started");
}

void update_finished() {
  mqtt.publish("Spa/node/debug", "Updated finished");
}

void update_progress(int cur, int total) {
  mqtt.publish("Spa/node/debug", "Update in progress");
}

void update_error(int err) {
  mqtt.publish("Spa/node/debug", "Updated error");
}

void lcd_init() {
  lcd.init();
  lcd.clear();         
  lcd.backlight();
}

void lcd_print(const char line1[], const char line2[]) {
  lcd.clear();
  lcd.setCursor(0,1); // character 0 line 2
  lcd.print(line1);
  lcd.setCursor(0,2); // character 0 line 3
  lcd.print(line2);
}

void lcd_print_msg(CircularBuffer<uint8_t, 35> &data) {
  String s;
  //for (i = 0; i < (Q_in[1] + 2); i++) {
  for (i = 0; i < data.size(); i++) {
    x = Q_in[i];
    if (x < 0x0A) s += "0";
    s += String(x, HEX);
    s += " ";
  }

  lcd_print("Message", s.c_str());
  _yield();
}

uint8_t crc8(CircularBuffer<uint8_t, 35> &data) {
  unsigned long crc;
  int i, bit;
  uint8_t length = data.size();

  crc = 0x02;
  for ( i = 0 ; i < length ; i++ ) {
    crc ^= data[i];
    for ( bit = 0 ; bit < 8 ; bit++ ) {
      if ( (crc & 0x80) != 0 ) {
        crc <<= 1;
        crc ^= 0x7;
      }
      else {
        crc <<= 1;
      }
    }
  }

  return crc ^ 0x02;
}

void rs485_send() {
  // The following is not required for the new RS485 chip
#if !AUTO_TX
  digitalWrite(TX485, HIGH);
  delay(1);
#endif


  // Add telegram length
  Q_out.unshift(Q_out.size() + 2);

  // Add CRC
  Q_out.push(crc8(Q_out));

  // Wrap telegram in SOF/EOF
  Q_out.unshift(0x7E);
  Q_out.push(0x7E);

  for (i = 0; i < Q_out.size(); i++)
    spaSerial.write(Q_out[i]);

