MrBasset/esp8266_spa/src/main.cpp
  //print_msg(Q_out);

  spaSerial.flush();

#if !AUTO_TX
    digitalWrite(TX485, LOW);
#endif

  // DEBUG: print_msg(Q_out);
  Q_out.clear();
}

void ID_request() {
  Q_out.push(0xFE);
  Q_out.push(0xBF);
  Q_out.push(0x01);
  Q_out.push(0x02);
  Q_out.push(0xF1);
  Q_out.push(0x73);

  rs485_send();
}

void ID_ack() {
  Q_out.push(id);
  Q_out.push(0xBF);
  Q_out.push(0x03);

  rs485_send();
}

void configModeCallback(AsyncWiFiManager *myWiFiManager) {
  Serial.println("Entered config mode");
  Serial.println(WiFi.softAPIP());

  lcd_print("IP address:", WiFi.softAPIP().toString().c_str());

  Serial.println(myWiFiManager->getConfigPortalSSID());
}

///////////////////////////////////////////////////////////////////////////////

const char *config_path = "/config.json";

void setup() {
  SerialDebug.init();

  lcd_init();

  if (LittleFS.begin() && LittleFS.exists(config_path)) {
    //WiFi Config exists, grab the config and connect as normal
    DynamicJsonDocument jsonSettings(1024);

    lcd_print("Fetching settings", "");
    SerialDebug.print("Fetching Settings");

    String WiFiSsid;
    String WiFiPassword;

    File file = LittleFS.open(config_path, "r");
    if (!file) {

      SerialDebug.print("Fatal:: Could not open file for reading");        
      ESP.reset();
      delay(5000);

    } else {
      deserializeJson(jsonSettings, file);

      strcpy(MqttIp, jsonSettings["BROKER_IP"].as<String>().c_str());
      strcpy(MqttPort, jsonSettings["BROKER_PORT"].as<String>().c_str());
      strcpy(MqttUser, jsonSettings["BROKER_USER"].as<String>().c_str());
      strcpy(MqttPassword, jsonSettings["BROKER_PASS"].as<String>().c_str());

      SerialDebug.print("Successfully read the configuration");
    }
    file.close();
  }

  AsyncWiFiManagerParameter custom_mqtt_ip("mqtt_ip", "mqtt ip", MqttIp, 40);
  AsyncWiFiManagerParameter custom_mqtt_port("mqtt_port", "mqtt port", MqttPort, 5);
  AsyncWiFiManagerParameter custom_mqtt_user("mqtt_user", "mqtt user", MqttUser, 40);
  AsyncWiFiManagerParameter custom_mqtt_password("mqtt_password", "mqtt password", MqttPassword, 40);

  AsyncWiFiManager wifiManager(&server,&dns);

  wifiManager.setSaveConfigCallback(saveConfigCallback);
  wifiManager.setAPCallback(configModeCallback);

  wifiManager.addParameter(&custom_mqtt_ip);
  wifiManager.addParameter(&custom_mqtt_port);
  wifiManager.addParameter(&custom_mqtt_user);
  wifiManager.addParameter(&custom_mqtt_password);

  //wifiManager.setTimeout(120);

  //fetches ssid and pass and tries to connect
  //if it does not connect it starts an access point with the specified name
  //here  "AutoConnectAP"
  //and goes into a blocking loop awaiting configuration
  if (!wifiManager.autoConnect("esp-spa")) {
    Serial.println("failed to connect and hit timeout");
    delay(3000);
    //reset and try again, or maybe put it to deep sleep
    ESP.reset();
    delay(5000);
  }

  //read updated parameters
  strcpy(MqttIp, custom_mqtt_ip.getValue());
  strcpy(MqttPort, custom_mqtt_port.getValue());
  strcpy(MqttUser, custom_mqtt_user.getValue());
  strcpy(MqttPassword, custom_mqtt_password.getValue());

  if (shouldSaveConfig) {
    
    //WiFi Config exists, grab the config and connect as normal
    DynamicJsonDocument jsonSettings(1024);
    jsonSettings["BROKER_IP"] = MqttIp;
    jsonSettings["BROKER_PORT"] = MqttPort;
    jsonSettings["BROKER_USER"] = MqttUser;
    jsonSettings["BROKER_PASS"] = MqttPassword;

    File f = LittleFS.open(config_path, "w");
    if (!f) {
      SerialDebug.print(F("Fatal:: failed to create file"));
    }

    if (serializeJson(jsonSettings, f) == 0) {
      SerialDebug.print(F("Fatal:: failed to write file"));
    }

    SerialDebug.print(F("Config file written, restarting"));
  }

  LittleFS.end();

  // Begin RS485 in listening mode -> no longer required with new RS485 chip
#if !AUTO_TX
  pinMode(TX485, OUTPUT);
  digitalWrite(TX485, LOW);
#endif

  // Route for root index.html
  server.on("/", HTTP_GET, [](AsyncWebServerRequest *request)
            { request->send(LittleFS, "/index.html", "text/html"); });

  server.begin();

  SerialDebug.initWeb(&server);

  lcd_print("Setting up Serial Busses", "");
  SerialDebug.print("Setting up software serial");

  //pinMode(RLY1, OUTPUT);
  //digitalWrite(RLY1, HIGH);
  //pinMode(RLY2, OUTPUT);
  //digitalWrite(RLY2, HIGH);

  // Spa communication, 115.200 baud 8N1
  spaSerial.begin(115200,EspSoftwareSerial::SWSERIAL_8N1, GPIORX, GPIOTX, false); // Start software serial
  spaSerial.enableIntTx(false); // This is needed with high baudrates

  // give Spa time to wake up after POST
  for (uint8_t i = 0; i < 5; i++) {
    delay(1000);
    yield();
  }

  Q_in.clear();
  Q_out.clear();

  lcd_print("IP address:", WiFi.localIP().toString().c_str());
  SerialDebug.print(F("IP address: "), false);
  SerialDebug.print(WiFi.localIP());

  SerialDebug.print(F("Arudino OTA Starting"));

  ArduinoOTA.setPort(8266);
  ArduinoOTA.setHostname("esp-spa");
  ArduinoOTA.setPasswordHash("21232f297a57a5a743894a0e4a801fc3");

  ArduinoOTA.onStart([]() {
    String type;
    if (ArduinoOTA.getCommand() == U_FLASH) {
      type = "sketch";
    } else {  // U_FS
      type = "filesystem";
    }

    // NOTE: if updating FS this would be the place to unmount FS using FS.end()
    SerialDebug.print(F("Start updating ") + type);
  });
  ArduinoOTA.onEnd([]() {
    SerialDebug.print("\nEnd");
  });
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    WebSerial.printf("Progress: %u%%\r", (progress / (total / 100)));
  });
  ArduinoOTA.onError([](ota_error_t error) {
    WebSerial.printf("Error[%u]: ", error);
    if (error == OTA_AUTH_ERROR) {
      SerialDebug.print("Auth Failed");
    } else if (error == OTA_BEGIN_ERROR) {
      SerialDebug.print("Begin Failed");
    } else if (error == OTA_CONNECT_ERROR) {
      SerialDebug.print("Connect Failed");
    } else if (error == OTA_RECEIVE_ERROR) {
      SerialDebug.print("Receive Failed");
    } else if (error == OTA_END_ERROR) {
      SerialDebug.print("End Failed");
    }
  });

  ArduinoOTA.begin();

  SerialDebug.print("MQTT Starting");

  mqtt.setServer(MqttIp, 1883);
  mqtt.setCallback(callback);
  mqtt.setKeepAlive(10);
  mqtt.setSocketTimeout(20);

