MrBasset/esp8266_spa/src/main.cpp
  //MDNS.begin("spa");
  MDNS.addService("http", "tcp", 80);

  /*the below is for debug purposes*/
  mqtt.connect("Spa1", MqttUser, MqttPassword);
  mqtt.publish("Spa/debug/wifi_ssid", WiFi.SSID().c_str());
  mqtt.publish("Spa/debug/broker", MqttIp);
  mqtt.publish("Spa/debug/broker_login", MqttUser);
  
  SerialDebug.print("MQTT Started");
}

void loop() {

  if (WiFi.status() != WL_CONNECTED) ESP.restart();
  if (!mqtt.connected()) reconnect();
  if (have_config == GOT_IT && have_preferences == GOT_IT) mqttpubsub(); //do mqtt stuff after we're connected and if we have got the config elements
  //httpServer.handleClient(); needed?
  _yield();

  /*
  ESPhttpUpdate.onStart(update_started);
  ESPhttpUpdate.onEnd(update_finished);
  ESPhttpUpdate.onProgress(update_progress);
  ESPhttpUpdate.onError(update_error);
  */

  //SerialDebug.print("SpaState Minutes: " + SpaState.minutes);

  //Every x minutes, read the fault log and filter settings using SpaState,minutes, and check for updates
  if ((int)(SpaState.minutes % 5) == 0)
  {

    //SerialDebug.print("Status Reading Fault/Filter");

    //logic to only get the error message once -> this is dirty
    //have_faultlog = 0;
    if (have_faultlog == 2) { // we got the fault log before and treated it
      if (faultlog_minutes == SpaState.minutes) { // we got the fault log this interval so do nothing
      }
      else {
        faultlog_minutes = SpaState.minutes;
        have_faultlog = WANT_IT;
      }
    }
    if (have_filtersettings == 2) { // we got the filter cycles before and treated it
      if (filtersettings_minutes == SpaState.minutes) { // we got the filter cycles this interval so do nothing
      }
      else {
        filtersettings_minutes = SpaState.minutes;
        have_filtersettings = WANT_IT;
      }
    }

    //perform binary updates
    /*
    WiFiClient wifiClient2;
    t_httpUpdate_return ret = ESPhttpUpdate.update(wifiClient2, NEXTVERSION);
    switch (ret) {
      case HTTP_UPDATE_FAILED:
        mqtt.publish("Spa/node/debug", "Update failed");
        break;

      case HTTP_UPDATE_NO_UPDATES:
        mqtt.publish("Spa/node/debug", "No update");
        break;

      case HTTP_UPDATE_OK:
        mqtt.publish("Spa/node/debug", "Update ok");
        break;
    }*/

  }

  //SerialDebug.print("Spa Serial is available: " + spaSerial.available());

  // DEBUG:mqtt.publish("Spa/rcv", String(x).c_str()); _yield();
  // Read from Spa RS485
  if (spaSerial.available()) {
    x = spaSerial.read();
    Q_in.push(x);

    //mqtt.publish("Spa/debug/rcv", String(x).c_str()); //_yield();

    //Serial.print(" " + String(x, HEX));

    // Drop until SOF is seen
    if (Q_in.first() != 0x7E) Q_in.clear();
    lastrx = millis();
  }
  // else 
  // {
  //   mqtt.publish("Spa/debug/serial", String(Serial.available()).c_str());
  // }

  // Double SOF-marker, drop last one
  if (Q_in[1] == 0x7E && Q_in.size() > 1) Q_in.pop();

  // Complete package
  //if (x == 0x7E && Q_in[0] == 0x7E && Q_in[1] != 0x7E) {
  if (x == 0x7E && Q_in.size() > 2) {
    //print_msg();

    //serial_print_msg(Q_in);

    // Unregistered or yet in progress
    if (id == 0) {
      if (Q_in[2] == 0xFE) print_msg(Q_in);

      // FE BF 02:got new client ID
      if (Q_in[2] == 0xFE && Q_in[4] == 0x02) {
        id = Q_in[5];
        if (id > 0x2F) id = 0x2F;

        ID_ack();
        mqtt.publish("Spa/node/id", String(id).c_str());
      }

      // FE BF 00:Any new clients?
      if (Q_in[2] == 0xFE && Q_in[4] == 0x00) {
        ID_request();
      }
    } else if (Q_in[2] == id && Q_in[4] == 0x06) { // we have an ID, do clever stuff
        // id BF 06:Ready to Send
        if (send == 0xff) {
          // 0xff marks dirty temperature for now
          Q_out.push(id);
          Q_out.push(0xBF);
          Q_out.push(0x20);
          Q_out.push(settemp);
        } else if (send == 0x00) {
          if (have_config == WANT_IT) { // Get configuration of the hot tub
            Q_out.push(id);
            Q_out.push(0xBF);
            Q_out.push(0x22);
            Q_out.push(0x00);
            Q_out.push(0x00);
            Q_out.push(0x01);
            //mqtt.publish("Spa/config/status", "Getting config");
            have_config = REQUESTED_IT;
          } else if (have_preferences == WANT_IT) {
            Q_out.push(id);
            Q_out.push(0xBF);
            Q_out.push(0x22);
            Q_out.push(0x08);
            Q_out.push(0x00);
            Q_out.push(0x00);
            //mqtt.publish("Spa/config/status", "Getting config");
            have_preferences = REQUESTED_IT;
          } else if (have_faultlog == WANT_IT) { // Get the fault log
            Q_out.push(id);
            Q_out.push(0xBF);
            Q_out.push(0x22);
            Q_out.push(0x20);
            Q_out.push(0xFF);
            Q_out.push(0x00);
            have_faultlog = REQUESTED_IT;
            //mqtt.publish("Spa/debug/have_faultlog", "requesting fault log, #1");
          } else if ((have_filtersettings == WANT_IT) && (have_faultlog == GOT_IT)) { // Get the filter cycles log once we have the faultlog
            Q_out.push(id);
            Q_out.push(0xBF);
            Q_out.push(0x22);
            Q_out.push(0x01);
            Q_out.push(0x00);
            Q_out.push(0x00);
            //mqtt.publish("Spa/debug/have_faultlog", "requesting filter settings, #1");
            have_filtersettings = REQUESTED_IT;
          } else {
            // A Nothing to Send message is sent by a client immediately after a Clear to Send message if the client has no messages to send.
            Q_out.push(id);
            Q_out.push(0xBF);
            Q_out.push(0x07);
          }
        } else {
          // Send toggle commands
          Q_out.push(id);
          Q_out.push(0xBF);
          Q_out.push(0x11);
          Q_out.push(send);
          Q_out.push(0x00);
        }

        rs485_send();
        send = 0x00;
    } else if (Q_in[2] == id && Q_in[4] == 0x2E) {
      if (last_state_crc != Q_in[Q_in[1]]) {
        decodeSettings();
      }
    } else if (Q_in[2] == id && Q_in[4] == 0x26) {
      if (last_state_crc != Q_in[Q_in[1]]) {
        decodePreferences();
      }
    } else if (Q_in[2] == id && Q_in[4] == 0x28) {
      if (last_state_crc != Q_in[Q_in[1]]) {
        decodeFault();
      }
    } else if (Q_in[2] == 0xFF && Q_in[4] == 0x13) { // FF AF 13:Status Update - Packet index offset 5
      if (last_state_crc != Q_in[Q_in[1]]) {
        decodeState();
      }
    } else if (Q_in[2] == id && Q_in[4] == 0x23) { // FF AF 23:Filter Cycle Message - Packet index offset 5
      if (last_state_crc != Q_in[Q_in[1]]) {
        //mqtt.publish("Spa/debug/have_faultlog", "decoding filter settings");
        decodeFilterSettings();
      }
    } else {
      // DEBUG for finding meaning
      //if (Q_in[2] & 0xFE || Q_in[2] == id)
      //print_msg(Q_in);
    }

    // Clean up queue
    _yield();
    Q_in.clear();
  }

  // Long time no receive
  if (millis() - lastrx > 10000) {
    if (PRODUCTION) {
      SerialDebug.print(F("Hard reset"));
      hardreset();
    }
  }
}
